org/learning.org
this is an intro to org mode, and a chance to use as many different org
functions as possible to learn how everything works.


* this is a top level 

  1. this is item 1
  2. this is item 2
  3. this is tiem 3
     this is an idented item
     this is another item

* this is a new item

  - lksjdf
  - lkjsdf
  - lksjdf
    - another
    - another
  - shift-tab does alot

* 
* this is the top level

** item

   - another
   - another
   - another

** another

   1) meta enter then ctrl-c minus
   2) another meta enter
   3) shift plus R / L changes bullets

** ctrl enter breaks out

   1. more lists
   2. plain lists
      enter tab indents
      more indents
