org/learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>learning</title>
<!-- 2018-01-29 Mon 13:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josh Lawrence" />
</head>
<body>
<div id="content">
<h1 class="title">learning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. this is a top level</a></li>
<li><a href="#sec-2">2. this is a new item</a></li>
<li><a href="#sec-3">3. </a></li>
<li><a href="#sec-4">4. this is the top level</a>
<ul>
<li><a href="#sec-4-1">4.1. item</a></li>
<li><a href="#sec-4-2">4.2. another</a></li>
<li><a href="#sec-4-3">4.3. ctrl enter breaks out</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
this is an intro to org mode, and a chance to use as many different org
functions as possible to learn how everything works.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> this is a top level</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>this is item 1
</li>
<li>this is item 2
</li>
<li>this is tiem 3
this is an idented item
this is another item
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> this is a new item</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>lksjdf
</li>
<li>lkjsdf
</li>
<li>lksjdf
<ul class="org-ul">
<li>another
</li>
<li>another
</li>
</ul>
</li>
<li>shift-tab does alot
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> </h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> this is the top level</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> item</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>another
</li>
<li>another
</li>
<li>another
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> another</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>meta enter then ctrl-c minus
</li>
<li>another meta enter
</li>
<li>shift plus R / L changes bullets
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> ctrl enter breaks out</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>more lists
</li>
<li>plain lists
enter tab indents
more indents
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh Lawrence</p>
<p class="date">Created: 2018-01-29 Mon 13:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
